Revit 2026 API

# ParameterMapIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ParameterMapIterator()
```
```vb
Public Sub New
```
```cpp
public:
ParameterMapIterator()
```
```fsharp
new : unit -> ParameterMapIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ParameterMapIterator Class

Autodesk.Revit.DB Namespace